#სავარჯიშო 2

# num = float(input("Please enter number: "))
#
# if num > 0:
#     print(num, " is Positive.")
# else:
#     print(num, "is not Positive.")

#სავარჯიშო 3

# num = int(input("გთხოვთ შეიყვანოთ სასურველი რიცხვი: "))
#
# if num % 10 == 0:
#     print(num, " რიცხვი ბოლოვდება 0-ით.")
# else:
#     print("რიცხვი ", num, " არ ბოლოვდება 0-ით.")

#სავარჯიშო 4

# num0 = int(input("გთხოვთ შეიყვანოთ პირველი სასურველი რიცხვი: "))
# num1 = int(input("გთხოვთ შეიყვანოთ მეორე სასურველი რიცხვი: "))
#
# if (num0 > 10 and num1 > 10):
#     print(num0, "-ისა და ", num1, "-ის საშუალო არითმეტიკული არის ", (num0 + num1)/2, ".")
# else:
#     print(num0, "-ისა და ", num1, "-ის ნამრავლი არის ", num0 * num1, ".")

#სავარჯიშო 5

# num = float(input("Please enter number: "))
#
# if num > 0:
#     print(num, " is Positive.")
# elif num == 0:
#     print(num, " is equal to Zero.")
# elif num < 0:
#     print(num, " is Negative.")

#სავარჯიშო 6

# num0 = input("გთხოვთ შეიყვანეთ პირველი რიცხვი: ")
# num1 = input("გთხოვთ შეიყვანეთ მეორე რიცხვი: ")
# num2 = input("გთხოვთ შეიყვანეთ მესამე რიცხვი: ")
#
# if num0 < num1:
#     print("პირველი რიცხვი (", num0, ") არის მოცემულ რიცხვებს შორის უმცირესი.")
# elif num1<num2:
#     print("მეორე რიცხვი (", num1, ") არის მოცემულ რიცხვებს შორის უმცირესი.")
# else:
#     print("მესამე რიცხვი (", num2, ") არის მოცემულ რიცხვებს შორის უმცირესი.")

#სავარჯიშო 7

point = int(input("გთხოვთ შეიყვანოთ თქვენი ქულა: "))

if point < 0 or point > 100:
    print("თქვენი შეყვანილი ქულა (", point, ") უნდა იყოს 0-სა და 100-ს შორის. გთხოვთ გადაამოწმოთ მონაცემები და სცადოთ ხელახლა.")
elif 0 <= point <= 40:
    print("თქვენი შედეგია [F] (ჩაჭრილი).")
elif 41 <= point <= 50:
    print("თქვენი შედეგია [FX] (ჩაჭრილი გადაბარების უფლებით).")
elif 51 <= point <= 60:
    print("გილოცავთ! თქვენი შედეგია [E]!")
elif 61 <= point <= 70:
    print("გილოცავთ! თქვენი შედეგია [D]!")
elif 71 <= point <= 80:
    print("გილოცავთ! თქვენი შედეგია [C]!")
elif 81 <= point <= 90:
    print("გილოცავთ! თქვენი შედეგია [B]!")
elif 91 <= point <= 100:
    print("გილოცავთ! თქვენი შედეგია [A]!")

#სავარჯიშო 8

# x = int(input("x = "))
# y0 = x/5 + (2 + x)**3
# y1 = 5*x + (3+x**5)/4
#
# if x > 0:
#     print("y = ", y0)
# elif x <= 0:
#     print("y = ", y1)

#სავარჯიშო 9

# x = int(input("x = "))
# y0 = 2*x + x**2
# y1 = (3 + x)/(x + 1)
# y2 = 5*x
#
# if x == 1:
#     print("y = ", y2)
# elif x < 0:
#     print("y = ", y1)
# elif x > 0:
#     print("y = ", y0)
# elif x == 0:
#     print("Please enter other number.")

#სავარჯიშო 10

# num = int(input("გთხოვთ შეიყვანოთ სასურველი რიცხვი: "))
# rem = num % 10
#
# print("თქვენ მიერ შეყვანილი რიცხვის ბოლო ციფრია ", rem, ".")

#სავარჯიშო 11

# year = int(input("გთხოვთ შეიყვანოთ სასურველი წელი: "))
#
# if year % 4 == 0:
#     if (year % 100 == 0):
#         if (year % 400 == 0):
#             print ("თქვენს მიერ შეყვანილი წელი(", year, ") ნაკიანია.")
#         else:
#             print("თქვენს მიერ შეყვანილი წელი(", year, ") არ არის ნაკიანი.")
#     else:
#         print("თქვენს მიერ შეყვანილი წელი(", year, ") ნაკიანია.")
# else:
#     print("თქვენს მიერ შეყვანილი წელი(", year, ") არ არის ნაკიანი.")


#სავარჯიშო 11 ვარ 2

# year = int(input("გთხოვთ შეიყვანოთ სასურველი წელი: "))
#
# if (year % 4 == 0 and year % 100 != 0 or year % 400 == 0):
#     print("თქვენს მიერ შეყვანილი წელი(", year, ") ნაკიანია.")
# else:
#     print("თქვენს მიერ შეყვანილი წელი(", year, ") არ არის ნაკიანი.")
