#შუალედური გამოცდა 1

#ამოცანა 1

"ეს პროგრამა გკითხავთ ასაკს, რომლის შეყვანის შემდეგაც გეტყვით რომელ ასაკობრივ კატეგორიას მიეკუთვნებით."

# age = int(input("გთხოვთ შეიყვანოთ თქვენი ასაკი (მთელ რიცხვებში): "))
#
# if 0 <= age <= 10: print("თქვენ მიეკუთვნებით ასაკობრივ კატეგორიას: ბავშვი.")
# elif 11 <= age <= 19: print("თქვენ მიეკუთვნებით ასაკობრივ კატეგორიას: თინეიჯერი.")
# elif 20 <= age <= 30: print("თქვენ მიეკუთვნებით ასაკობრივ კატეგორიას: ახალგაზრდა.")
# elif 31 <= age <= 50: print("თქვენ მიეკუთვნებით ასაკობრივ კატეგორიას: ზრდასრული.")
# elif 51 <= age <= 80: print("თქვენ მიეკუთვნებით ასაკობრივ კატეგორიას: ასაკოვანი.")
# elif 81 <= age <= 100: print("თქვენ მიეკუთვნებით ასაკობრივ კატეგორიას: მხცოვანი.")
# elif 0 < age < 100: print("თქვენს მიერ შეყვანილი რიცხვი არ არის ასაკი!")

#ამოცანა 2

"ეს პროგრამა გთხოვთ შეიყვანოთ ორი რიცხვი, რომლის შემდეგაც ის გიპასუხებთ არიან თუ არა ეს ორი რიცხვი მეგობარი რიცხვები."

# num1 = int(input("გთხოვთ შეიყვანოთ პირველი რიცხვი: "))
# num2 = int(input("გთხოვთ შეიყვანოთ მეორე რიცხვი: "))
# sum1 = 0
# sum2 = 0
#
# for each1 in range(1, num1):
#     if num1 % each1 == 0:
#         sum1 += each1
# for each2 in range(1, num2):
#     if num2 % each2 == 0:
#         sum2 += each2
#
# if sum1 == num2 and sum2 == num1: print("ეს რიცხვები არიან მეგობარი რიცხვები.")
# else: print("სამწუხაროდ, ეს რიცხვები ვერ მეგობრობენ :(")